Revit 2027 API
Application.ExportIFCCategoryTable Property
 Full path to the file that defines Revit category to IFC entity mappings for IFC export.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ExportIFCCategoryTable { get; }
Public ReadOnly Property ExportIFCCategoryTable As String
	Get
public:
property String^ ExportIFCCategoryTable {
	String^ get ();
}
member ExportIFCCategoryTable : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace